In [1]:
import pandas as pd
df=pd.read_excel(r"C:\Users\yvsur\Downloads\temperature.xlsx")
df

         date       city  temperature  humidity condition
0  2025-04-12  hyderabad           23        32     sunny
1  2025-04-13  hyderabad           43        55     sunny
2  2025-04-14  hyderabad           32        33     sunny
3  2025-04-15   banglore           54        97    cloudy
4  2025-04-16   banglore           12        47    cloudy
5  2025-04-17   banglore           65        49    cloudy
6  2025-04-18    chennai           56        61    cloudy
7  2025-04-19        kkd           45        82    cloudy
8  2025-04-20      vizag           87        83     sunny
9  2025-04-21      vizag           66        23    cloudy
10 2025-04-22  vijaywada           33        11     sunny
11 2025-04-23  vijaywada           22        76    cloudy

In [3]:
df.head()

        date       city  temperature  humidity condition
0 2025-04-12  hyderabad           23        32     sunny
1 2025-04-13  hyderabad           43        55     sunny
2 2025-04-14  hyderabad           32        33     sunny
3 2025-04-15   banglore           54        97    cloudy
4 2025-04-16   banglore           12        47    cloudy

In [4]:
df.tail()

         date       city  temperature  humidity condition
7  2025-04-19        kkd           45        82    cloudy
8  2025-04-20      vizag           87        83     sunny
9  2025-04-21      vizag           66        23    cloudy
10 2025-04-22  vijaywada           33        11     sunny
11 2025-04-23  vijaywada           22        76    cloudy

In [5]:
df.head(2)

        date       city  temperature  humidity condition
0 2025-04-12  hyderabad           23        32     sunny
1 2025-04-13  hyderabad           43        55     sunny

In [6]:
df.tail(7)

         date       city  temperature  humidity condition
5  2025-04-17   banglore           65        49    cloudy
6  2025-04-18    chennai           56        61    cloudy
7  2025-04-19        kkd           45        82    cloudy
8  2025-04-20      vizag           87        83     sunny
9  2025-04-21      vizag           66        23    cloudy
10 2025-04-22  vijaywada           33        11     sunny
11 2025-04-23  vijaywada           22        76    cloudy

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         12 non-null     datetime64[ns]
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   humidity     12 non-null     int64
 4   condition    12 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 612.0+ bytes

In [8]:
df.shape

(12, 5)

In [9]:
df[2:5]

        date       city  temperature  humidity condition
2 2025-04-14  hyderabad           32        33     sunny
3 2025-04-15   banglore           54        97    cloudy
4 2025-04-16   banglore           12        47    cloudy

In [10]:
df.columns

Index(['date', 'city', 'temperature', 'humidity', 'condition'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [12]:
df.dtypes

date           datetime64[ns]
city                   object
temperature             int64
humidity                int64
condition              object
dtype: object

In [13]:
df.date

0    2025-04-12
1    2025-04-13
2    2025-04-14
3    2025-04-15
4    2025-04-16
5    2025-04-17
6    2025-04-18
7    2025-04-19
8    2025-04-20
9    2025-04-21
10   2025-04-22
11   2025-04-23
Name: date, dtype: datetime64[ns]

In [14]:
df["date"]

0    2025-04-12
1    2025-04-13
2    2025-04-14
3    2025-04-15
4    2025-04-16
5    2025-04-17
6    2025-04-18
7    2025-04-19
8    2025-04-20
9    2025-04-21
10   2025-04-22
11   2025-04-23
Name: date, dtype: datetime64[ns]

In [15]:
df[["date","condition"]]

         date condition
0  2025-04-12     sunny
1  2025-04-13     sunny
2  2025-04-14     sunny
3  2025-04-15    cloudy
4  2025-04-16    cloudy
5  2025-04-17    cloudy
6  2025-04-18    cloudy
7  2025-04-19    cloudy
8  2025-04-20     sunny
9  2025-04-21    cloudy
10 2025-04-22     sunny
11 2025-04-23    cloudy

In [18]:
df["date"][df["condition"]=="sunny"]

0    2025-04-12
1    2025-04-13
2    2025-04-14
8    2025-04-20
10   2025-04-22
Name: date, dtype: datetime64[ns]

### reading data

In [20]:
import pandas as pd
df=pd.DataFrame({
    "name":["kaveri","niha","sweety","prash","ramya","yamuna","devi"],
    "rollno":[3,9,54,41,52,37,56]
})
df

     name  rollno
0  kaveri       3
1    niha       9
2  sweety      54
3   prash      41
4   ramya      52
5  yamuna      37
6    devi      56

In [21]:
df.head()

     name  rollno
0  kaveri       3
1    niha       9
2  sweety      54
3   prash      41
4   ramya      52

In [22]:
df.tail()

     name  rollno
2  sweety      54
3   prash      41
4   ramya      52
5  yamuna      37
6    devi      56

In [23]:
df.head(3)

     name  rollno
0  kaveri       3
1    niha       9
2  sweety      54

In [24]:
df.tail(1)

   name  rollno
6  devi      56

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   rollno  7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

In [26]:
df.shape

(7, 2)

In [27]:
df.name

0    kaveri
1      niha
2    sweety
3     prash
4     ramya
5    yamuna
6      devi
Name: name, dtype: object

In [28]:
df.rollno

0     3
1     9
2    54
3    41
4    52
5    37
6    56
Name: rollno, dtype: int64

In [29]:
df.columns

Index(['name', 'rollno'], dtype='object')

In [30]:
df[1:5]

     name  rollno
1    niha       9
2  sweety      54
3   prash      41
4   ramya      52

In [31]:
df[["name","rollno"]]

     name  rollno
0  kaveri       3
1    niha       9
2  sweety      54
3   prash      41
4   ramya      52
5  yamuna      37
6    devi      56

In [32]:
df['name']

0    kaveri
1      niha
2    sweety
3     prash
4     ramya
5    yamuna
6      devi
Name: name, dtype: object

In [37]:
df['name'][df["rollno"]==3]

0    kaveri
Name: name, dtype: object